//黑杰克游戏配置信息
var Config = {
  //红桃 黑桃 梅花 方片
  porker : ['h1', 'h2', 'h3', 'h4', 'h5', 'h6', 'h7', 'h8', 'h9', 'h10', 'hj', 'hq', 'hk',
            's1', 's2', 's3', 's4', 's5', 's6', 's7', 's8', 's9', 's10', 'sj', 'sq', 'sk',
            'c1', 'c2', 'c3', 'c4', 'c5', 'c6', 'c7', 'c8', 'c9', 'c10', 'cj', 'cq', 'ck',
            'd1', 'd2', 'd3', 'd4', 'd5', 'd6', 'd7', 'd8', 'd9', 'd10', 'dj', 'dq', 'dk'],
  rules : '人物角色：庄家 pk 玩家。<br>'+
          '规则详情：游戏开始先给玩家发2张牌，再给庄家发2张（一张明牌，一张暗牌）。'+
          '玩家根据手中牌的点数可选择继续要牌还是停牌，若玩家选择要牌，系统为其发一张牌；'+
          '若玩家选择停牌，则展示庄家暗牌，若庄家牌点数和小于19（19为系统设置的庄家界限值），'+
          '系统自动为庄家发牌直到等于19停止。'+
          '系统每发一次牌都会计算玩家或庄家当前点数和，'+'在尽量满足不越界条件下A牌值可作为1或11计算。<br>'+
          '胜负条件：原则上谁的点数和先等于21谁获胜，当有任意一方点数和越界则输掉该局，对方获胜。',
  actor : {
    'banker' : {
      //初始金额，牌的点数
        initMoney : 0,
        cardPoint : 0
    },
    'player' : {
        initMoney : 100,
        cardPoint : 0
    }
  }
}
